#### **Importando Librerias Python**

In [50]:
from PIL import Image
import pandas as pd
import sqlalchemy
import urllib
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline
# collections as c
# Con collections, importamos la libreria y todas sus herramientas.
#from collections import defaultdict
# Al colocar el from, solo haremos la importación de una herramienta especifica que se encuentra dentro de la libreria "collections"
from collections import defaultdict as ddict
# Ahora le hemos agregado un alias, para no repetir los nombres.
import datetime
import os
import pyodbc as podbc# Conección SQL Server.import pandas as pd
import openpyxl
import xlrd

In [51]:
#%pip install openpyxl

In [52]:
#%pip install xlrd

#### **Como importar datos de un repositorio en GitHub (Raw)**

In [53]:
#df = pd.read_csv('https://raw.githubusercontent.com/BitecodeHTML/https-github.com-mwaskom-seaborn-data/master/tips.csv')

#print(df.head())

In [54]:
df = pd.read_excel('Nashville Housing Data for Data Cleaning.xlsx')

In [55]:
print(df.sample(10))

       UniqueID           ParcelID                  LandUse                 PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                            OwnerName                        OwnerAddress  Acreage                TaxDistrict  LandValue  BuildingValue  TotalValue  YearBuilt  Bedrooms  FullBath  HalfBath
7585       28138   070 09 0 066.00            SINGLE FAMILY      3104  CURTIS ST, NASHVILLE 2015-03-18      79500  20150325-0025526           No                       BROWN, KYLE A.      3104  CURTIS ST, NASHVILLE, TN     0.19    URBAN SERVICES DISTRICT    18000.0        45800.0     64300.0     1935.0       2.0       1.0       0.0
21122       2252   093 08 0 038.00          VACANT RES LAND    1002  GLENVIEW DR, NASHVILLE 2013-04-16      25000  20130424-0040584            N    PIERCE, JAMES E. S. & EMILY J. B.    1002  GLENVIEW DR, NASHVILLE, TN     0.17    URBAN SERVICES DISTRICT    25000.0       256600.0    281600.0     2014.0       3.0       2.0       1.0
19949      11680   092 05 0 284.00                   DUPLEX      807  32ND AVE N, NASHVILLE 2014-01-10      35000  20140203-0009342           No          ALAM, SAYED & NASRIN SIDIQI      807  32ND AVE N, NASHVILLE, TN     0.20    URBAN SERVICES DISTRICT    13000.0        62600.0     75600.0     1978.0       4.0       2.0       0.0
41965      52969   142 15 0 081.00            SINGLE FAMILY   532 BELLEVUE  RD N, NASHVILLE 2016-08-25     220000  20160830-0090642           No                  GROVER, MARGARET F.   532  BELLEVUE RD N, NASHVILLE, TN     0.30  GENERAL SERVICES DISTRICT    36000.0       119500.0    155500.0     1966.0       3.0       1.0       1.0
54121      20399  176 05 0A 080.00            SINGLE FAMILY     6632  SHADYVIEW DR, ANTIOCH 2014-08-26    5491000  20140829-0079368           No                                  NaN                                 NaN      NaN                        NaN        NaN            NaN         NaN        NaN       NaN       NaN       NaN
45144       7399   150 07 0 161.00            SINGLE FAMILY  3233  COUNTRY LAWN DR, ANTIOCH 2013-08-23     103000  20130826-0089843           No                        KITARA, GRACE  3233  COUNTRY LAWN DR, ANTIOCH, TN     0.24    URBAN SERVICES DISTRICT    27500.0        80100.0    107600.0     1983.0       3.0       2.0       0.0
22696      35251   095 11 0 047.00            SINGLE FAMILY   2412  WOODBERRY DR, NASHVILLE 2015-07-15     163000  20150721-0071194           No                    MCCASLAND, RODNEY   2412  WOODBERRY DR, NASHVILLE, TN     0.39    URBAN SERVICES DISTRICT    27000.0       119200.0    146200.0     1958.0       3.0       1.0       1.0
44780      41138   150 01 0 039.00            SINGLE FAMILY   480  RURAL HILL RD, NASHVILLE 2015-11-24     134900  20151204-0122647           No  SVOBODA, FILIP ALBERT & KERRY LEANN   480  RURAL HILL RD, NASHVILLE, TN     0.29    URBAN SERVICES DISTRICT    24000.0        83000.0    107000.0     1965.0       3.0       1.0       1.0
14326      33797   082 13 0 364.00            SINGLE FAMILY  900 B  LOCKLAYER ST, NASHVILLE 2015-06-08     332000  20150610-0054645           No                   3L PROPERTIES, LLC   900 B LOCKLAYER ST, NASHVILLE, TN     0.08    URBAN SERVICES DISTRICT    40000.0       168100.0    208100.0     2005.0       3.0       2.0       1.0
56152      37550  186 04 0A 387.00  VACANT RESIDENTIAL LAND  9037  MACAULEY LN, NOLENSVILLE 2015-09-04     404090  20150908-0091058          Yes                                  NaN                                 NaN      NaN                        NaN        NaN            NaN         NaN        NaN       NaN       NaN       NaN

#### **Conexión de base de datos**

In [56]:
'''# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
#database = 'tu_base_de_datos'
#username = 'tu_usuario'
#password = 'tu_contraseña'

#! Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', host = server)

print("Conexión Exitosa")

#! Crear un cursor
cursor = conexion.cursor()

cursor.execute("CREATE DATABASE PORTFOLIO_PROYECT")

#! Nos aseguramos de cerrar la conexión

conexion.close()'''

#! Nos permite crear una base de datos, en nuestro ejemplo es "PORTFOLIO_PROYECT".
#! Para este ejemplo no vamos a crear una nueva base de datos, porque ya tenemos una que se titula "PORTFOLIO_PROYECT."
#! Hemos comentado todo el codigo con '''''', para que no se ejecute.

'# Parámetros de conexión\nserver = \'DESKTOP-CK3D4E3\\SQLEXPRESS02\'\n#database = \'tu_base_de_datos\'\n#username = \'tu_usuario\'\n#password = \'tu_contraseña\'\n\n#! Llevamos a cabo la conexión con el servidor\n\nconexion = podbc.connect(driver= \'{SQL server}\', host = server)\n\nprint("Conexión Exitosa")\n\n#! Crear un cursor\ncursor = conexion.cursor()\n\ncursor.execute("CREATE DATABASE PORTFOLIO_PROYECT")\n\n#! Nos aseguramos de cerrar la conexión\n\nconexion.close()'

#### **Conexión a nuestras DNS**

**Cada vez que necesitemos conectarnos a una base de datos,
debemos crear un DNS, en nuestro ejemplo tenemos la base de datos "Portfolio_Proyect" para ello, apretamos la tecla windows del teclado y nos vamos a la opción "Herramientas administrativas de windows" y buscamos el aplicativo que dice "Origenes de datos ODBC (64 bits), la cual nos la podemos descargar e instalar desde google, luego de ello nos sale un cuadro y vamos a la opción "Agregar", en nombre elegimos la opción "SQL", luego de ello nos va a pedir un "nombre" que le podemos poner cualquiera, pero lo recomendable es que sea la misma de la tabla que tenemos creada en nuestra base de datos SQL, en "descripción" no es necesario lo podemos obviar, y en servidor elegimos el servidor al cual estamos conectados, en mi caso es "DESKTOP-CK3D4E3\SQLEXPRESS02", luego le damos dos veces a siguiente y en el cuadro le damos check a la primera opción que nos dice "Establecer la siguiente base de datos como predeterminada" y elegimos nuestra base de datos, que en mi caso es "Portfolio_Proyect" y por ultimo le damos a siguiente y finalizar, con ello hemos terminado la configuración, ahora podemos usar el nombre de dicho DNS creado en nuestro codigo que se encuentra en nuestro cuaderno de Jupyter Notebook.**

In [57]:
def conexion_sql_server():
# Nombre de nuestro DSN (puedes cambiarlo al DSN que has configurado)
    dsn = 'Portfolio_Proyect'

# Cadena de conexión SQLAlchemy utilizando DSN
    connection_string = f"mssql+pyodbc:///?odbc_connect={urllib.parse.quote_plus(f'DSN={dsn};Trusted_Connection=yes')}"
    engine = sqlalchemy.create_engine(connection_string, echo=False)

# Devolver la conexión
    return engine

def select_to_df(sql_query, connection):
    try:
# Utilizamos la conexión para ejecutar la consulta y cargar los resultados en un DataFrame de Pandas
        df = pd.read_sql_query(sql_query, connection)
        return df
    except Exception as e:
        print(e)
        return df
    
#! Vamos a trabajar con el mismo dns "Portfolio_Proyect" el cual hace referencia a nuestra base de datos "PORTFOLIO_PROYECT".

In [58]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df("SELECT * FROM NashvilleHousing", conexion)

# Muestra el DataFrame
print(df.sample(10))

# ! Nos permite ejecutar nuestra tabla "NashvilleHousing"
# Todo: Nos permite ejecutar nuestra tabla "NashvilleHousing"
# ? Nos permite ejecutar nuestra tabla "NashvilleHousing"

       UniqueID           ParcelID            LandUse                    PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                           OwnerName                      OwnerAddress  ...  YearBuilt Bedrooms  FullBath  HalfBath  SaleDateConverted    PropertySplitAddress  PropertySplitCity  OwnerSplitAddress  OwnerSplitCity OwnerSplitState
27077    14501.0   071 08 0 368.00      SINGLE FAMILY           504  EDWIN ST, NASHVILLE 2014-04-08    67500.0  20140411-0030451           No             WALLIS, WILLIAM G., SR.      504  EDWIN ST, NASHVILLE, TN  ...     1949.0      3.0       1.0       0.0         2014-04-08           504  EDWIN ST          NASHVILLE      504  EDWIN ST       NASHVILLE              TN
28068     3264.0   071 14 0 081.00    VACANT RES LAND         114 B  FERN AVE, NASHVILLE 2013-05-21   130000.0  20130528-0053171           No         HEITHCOCK CONSTRUCTION, LLC     114 B FERN AVE, NASHVILLE, TN  ...        NaN      NaN       NaN       NaN         2013-05-21         114 B  FERN AVE          NASHVILLE     114 B FERN AVE       NASHVILLE              TN
12542    26686.0   150 05 0 048.00      SINGLE FAMILY          428  OWENDALE DR, ANTIOCH 2015-02-19   136500.0  20150219-0014520           No                  RIDLEY, GREGORY K.     428  OWENDALE DR, ANTIOCH, TN  ...     1968.0      3.0       2.0       0.0         2015-02-19        428  OWENDALE DR            ANTIOCH   428  OWENDALE DR         ANTIOCH              TN
39591    21546.0  083 13 0B 309.00  RESIDENTIAL CONDO     1015  FATHERLAND ST, NASHVILLE 2014-09-26   235000.0  20140930-0090334           No                                None                              None  ...        NaN      NaN       NaN       NaN         2014-09-26     1015  FATHERLAND ST          NASHVILLE               None            None            None
53232    15896.0  109 08 0A 042.00    VACANT RES LAND  3001  COOKS LANDING CT, HERMITAGE 2014-05-15   584100.0  20140515-0041982          Yes                                None                              None  ...        NaN      NaN       NaN       NaN         2014-05-15  3001  COOKS LANDING CT          HERMITAGE               None            None            None
50966     9565.0   105 05 0 017.00    VACANT RES LAND        1223  15TH AVE S, NASHVILLE 2013-11-04   549000.0  20131106-0115225           No  WILSON, JOHN T. & MILLNER, MARY A.   1223  15TH AVE S, NASHVILLE, TN  ...     2013.0      5.0       3.0       0.0         2013-11-04        1223  15TH AVE S          NASHVILLE   1223  15TH AVE S       NASHVILLE              TN
9988     46114.0   147 04 0 156.00      SINGLE FAMILY       279  RICHBRIAR RD, NASHVILLE 2016-04-11   169900.0  20160414-0035700           No                 HOHNE, ALEX & LINDA  279  RICHBRIAR RD, NASHVILLE, TN  ...     1967.0      3.0       2.0       0.0         2016-04-11       279  RICHBRIAR RD          NASHVILLE  279  RICHBRIAR RD       NASHVILLE              TN
37664    14928.0  082 13 0G 105.00  RESIDENTIAL CONDO         303  CRIDDLE ST, NASHVILLE 2014-04-25   168900.0  20140428-0035481           No                                None                              None  ...        NaN      NaN       NaN       NaN         2014-04-25         303  CRIDDLE ST          NASHVILLE               None            None            None
21168    41908.0  059 15 0A 133.00      SINGLE FAMILY        933  BORDEAUX PL, NASHVILLE 2015-12-17   214990.0  20151221-0127758           No                                None                              None  ...        NaN      NaN       NaN       NaN         2015-12-17        933  BORDEAUX PL          NASHVILLE               None            None            None
1727     34693.0  126 15 0A 029.00      SINGLE FAMILY     7840  FARMINGTON PL, NASHVILLE 2015-07-28   213250.0  20150825-0085878           No                                None                              None  ...        NaN      NaN       NaN       NaN         2015-07-28     7840  FARMINGTON PL          NASHVILLE               None            None            None

[10 rows x 25 columns]

In [11]:
df.shape

#! Nos indica cuantas filas y columnas tenemos en nuestro Data Frame.

(56477, 25)

In [59]:
'''
Standardize Date Format
'''

'\nStandardize Date Format\n'

In [14]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Alteración de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
    ALTER TABLE NashvilleHousing
        ADD SaleDateConverted Date;
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite alterar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:1

Alteración de tabla Exitosa

In [15]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
    UPDATE NashvilleHousing
        SET SaleDateConverted = CONVERT (date, SaleDate);
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:2

Actualización de tabla Exitosa

In [16]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
    SELECT SaleDateConverted, CONVERT (date, SaleDate) AS Date
        FROM NashvilleHousing;
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite transformar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:3

Actualización de tabla Exitosa

In [17]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT *
                        FROM NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Nos permite ejecutar nuestra tabla "NashvilleHousing"
#! Nos permite visualizar la nueva columna "SaleDateConverted".

       UniqueID           ParcelID                  LandUse                     PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                             OwnerName                        OwnerAddress  Acreage              TaxDistrict  LandValue  BuildingValue  TotalValue  YearBuilt  Bedrooms  FullBath  HalfBath SaleDateConverted
14095    37109.0  151 01 0A 157.00            SINGLE FAMILY         3120  KENNEBECK PL, ANTIOCH 2015-08-14   165000.0  20150819-0083618           No                                  None                                None      NaN                     None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2015-08-14
51026    20497.0   105 04 0 025.00  VACANT RESIDENTIAL LAND           30  TRIMBLE ST, NASHVILLE 2014-09-19    65000.0  20140923-0087204           No               KITTLEMAN, RIKK ANTHONY       30  TRIMBLE ST, NASHVILLE, TN     0.07  URBAN SERVICES DISTRICT     1000.0            0.0      1000.0        NaN       NaN       NaN       NaN        2014-09-19
25566    26429.0  064 16 0A 139.00        RESIDENTIAL CONDO  139  GENERAL JACKSON LN, HERMITAGE 2015-01-05    82500.0  20150114-0003930           No                                  None                                None      NaN                     None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2015-01-05
16655     5781.0  049 01 0B 023.00          VACANT RES LAND  616  CHERRY GROVE PT, WHITES CREEK 2013-07-18   129000.0  20130719-0074736          Yes                                  None                                None      NaN                     None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2013-07-18
50453     4084.0   104 14 0 316.00            SINGLE FAMILY     2902 B  W LINDEN AVE, NASHVILLE 2013-06-17   770000.0  20130620-0063420           No         STEINER, GAIL & LEVINE, ROGER  2902 B W LINDEN AVE, NASHVILLE, TN     0.21  URBAN SERVICES DISTRICT   214500.0       422900.0    670400.0     2013.0       3.0       3.0       0.0        2013-06-17
29746    42061.0   072 07 0 301.00            SINGLE FAMILY         2200  GENEIVA DR, NASHVILLE 2015-12-15   220000.0  20151216-0126663           No  SORENSON, HANS S. & SMITH, LAUREN L.     2200  GENEIVA DR, NASHVILLE, TN     0.30  URBAN SERVICES DISTRICT    30000.0        86700.0    116700.0     1954.0       2.0       2.0       0.0        2015-12-15
37672    49471.0  082 13 0D 101.00        RESIDENTIAL CONDO          1204 6TH  AVE N, NASHVILLE 2016-05-05   230000.0  20160510-0046206           No                                  None                                None      NaN                     None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-05-05
15236    54650.0  043 10 0A 014.00        RESIDENTIAL CONDO          555 N DUPONT  AVE, MADISON 2016-09-14   123000.0  20160919-0098102          Yes                                  None                                None      NaN                     None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-09-14
28669    44183.0   072 03 0 384.00            SINGLE FAMILY         1111  HOWARD AVE, NASHVILLE 2016-02-12   268000.0  20160216-0014186           No                       ADCOCK, CHARLES     1111  HOWARD AVE, NASHVILLE, TN     0.26  URBAN SERVICES DISTRICT    37000.0       151700.0    188700.0     2002.0       3.0       2.0       0.0        2016-02-12
43566    32383.0   092 13 0 047.00            SINGLE FAMILY           3714  PARK AVE, NASHVILLE 2015-06-24   140000.0  20150625-0061181           No                  S.M. PROPERTIES, LLC       3714  PARK AVE, NASHVILLE, TN     0.17  URBAN SERVICES DISTRICT    65000.0        71300.0    139600.0     1920.0       3.0       1.0       0.0        2015-06-24

In [18]:
'''
Populate Property Address data
'''

'\nPopulate Property Address data\n'

In [19]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT PropertyAddress
                        FROM NashvilleHousing''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Nos permite ejecutar nuestra tabla "NashvilleHousing"
#! Solo visualizamos la columna "PropertyAddress".

                           PropertyAddress
4679        1114 A  BILTMORE DR, NASHVILLE
21306  3508  CUMBERLAND COVE DR, NASHVILLE
24192            1518  MOHAWK TRL, MADISON
28243      1307 ASTAINBACK  AVE, NASHVILLE
36411          1523  22ND AVE N, NASHVILLE
44539           1212  LAUREL ST, NASHVILLE
55202      2600  HILLSBORO PIKE, NASHVILLE
25425       104  SADDLE TREE DR, HERMITAGE
22040         1405  ROCKGLADE RUN, ANTIOCH
55401       0  NEW NATCHEZ TRCE, NASHVILLE

In [38]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT *
                        FROM NashvilleHousing
                        WHERE PropertyAddress is null;''', conexion)

# Muestra el DataFrame
print(df.sample(20))
print(f"Tenemos {df.shape} filas y columnas")
#! Nos permite ejecutar nuestra tabla "NashvilleHousing"
#! Solo visualizamos las filas vacias, referente a la columna "PropertyAddress".
#! Agregamos el codigo print(f"Tenemos {df.shape} filas y columnas"), para saber el # de filas y columnas.

    UniqueID           ParcelID                  LandUse PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                             OwnerName                            OwnerAddress  Acreage                TaxDistrict  LandValue  BuildingValue  TotalValue  YearBuilt  Bedrooms  FullBath  HalfBath SaleDateConverted
7     36531.0   034 03 0 059.00            SINGLE FAMILY            None 2015-08-13   245000.0  20150819-0083759           No        DILICK, JOHN MARK & ANNETTE A.             2117  PAULA DR, MADISON, TN     1.01  GENERAL SERVICES DISTRICT    32000.0       170000.0    228300.0     1964.0       4.0       3.0       0.0        2015-08-13
15    50927.0   044 05 0 135.00            SINGLE FAMILY            None 2016-06-15   160000.0  20160617-0061987           No                SMITH, WARREN & MARTHA        202  KEETON AVE, OLD HICKORY, TN     0.12  GENERAL SERVICES DISTRICT    19000.0       102700.0    121700.0     2015.0       4.0       2.0       0.0        2016-06-15
0     43076.0   025 07 0 031.00            SINGLE FAMILY            None 2016-01-15   179900.0  20160120-0005776           No               COSTNER, FRED & CAROLYN    410  ROSEHILL CT, GOODLETTSVILLE, TN     0.96     CITY OF GOODLETTSVILLE    30000.0        70000.0    100000.0     1964.0       3.0       1.0       0.0        2016-01-15
13    22775.0   043 09 0 074.00  VACANT RESIDENTIAL LAND            None 2014-10-27   151000.0  20141028-0099094          Yes                  BREWER HOLDINGS, LLC            213 B LOVELL ST, MADISON, TN     0.15  GENERAL SERVICES DISTRICT    18000.0       115600.0    133600.0     2015.0       3.0       2.0       0.0        2014-10-27
9     44264.0  034 16 0A 004.00  VACANT RESIDENTIAL LAND            None 2016-02-04   130000.0  20160205-0011327          Yes                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-02-04
4     43080.0   033 06 0 041.00            SINGLE FAMILY            None 2016-01-04   170000.0  20160107-0001526           No                 FRANK, ZACHARY & NIKI   1129  CAMPBELL RD, GOODLETTSVILLE, TN     0.24  GENERAL SERVICES DISTRICT    35000.0       110500.0    145500.0     2000.0       3.0       2.0       0.0        2016-01-04
27    51930.0  113 14 0A 002.00  VACANT RESIDENTIAL LAND            None 2016-07-05   133000.0  20160707-0069375          Yes                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-07-05
23    45774.0   107 13 0 107.00            SINGLE FAMILY            None 2016-03-28   169900.0  20160330-0030078           No                 GROOMS, MICAH & CASEY        1205  THOMPSON PL, NASHVILLE, TN     0.39    URBAN SERVICES DISTRICT    17000.0        75600.0     96200.0     1949.0       3.0       1.0       0.0        2016-03-28
24    14753.0  108 07 0A 026.00        RESIDENTIAL CONDO            None 2014-04-15    79900.0  20140416-0031777           No                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2014-04-15
5     45295.0  033 06 0A 002.00            SINGLE FAMILY            None 2016-03-29   210000.0  20160331-0030709           No                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-03-29
14    45349.0   043 13 0 308.00            SINGLE FAMILY            None 2016-03-31   155000.0  20160405-0032445           No     JACKSON, ADAM L. & MOORE, MARY A.            224  HICKORY ST, MADISON, TN     0.16  GENERAL SERVICES DISTRICT    16000.0        65900.0     81900.0     1940.0       2.0       1.0       0.0        2016-03-31
6     48731.0   033 15 0 123.00            SINGLE FAMILY            None 2016-05-05   199900.0  20160506-0045368           No  COLEMAN, AARON A. & CECIL, CORRIE J.  438  W CAMPBELL RD, GOODLETTSVILLE, TN     1.39  GENERAL SERVICES DISTRICT    45000.0        90300.0    135300.0     1954.0       2.0       1.0       0.0        2016-05-05
19    27140.0   092 06 0 282.00            SINGLE FAMILY            None 2015-02-20    41500.0  20150224-0015900           No              PROSPERITAS PARTNERS LLC          815  31ST AVE N, NASHVILLE, TN     0.17    URBAN SERVICES DISTRICT    13000.0        49400.0     62400.0     1960.0       2.0       1.0       0.0        2015-02-20
26    24197.0  110 03 0A 061.00            SINGLE FAMILY            None 2014-11-19   269750.0  20141120-0106962           No                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2014-11-19
17    43151.0  052 08 0A 320.00            SINGLE FAMILY            None 2016-01-15   150000.0  20160119-0004918           No                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-01-15
18    49886.0   092 06 0 273.00            SINGLE FAMILY            None 2016-06-21   186000.0  20160705-0068281           No                   SOLAVA, RACHEL LYNN          2721  HERMAN ST, NASHVILLE, TN     0.17    URBAN SERVICES DISTRICT     9000.0        63200.0     72200.0     1987.0       2.0       1.0       1.0        2016-06-21
8     46919.0  034 07 0B 015.00  VACANT RESIDENTIAL LAND            None 2016-04-27    40000.0  20160304-0020905          Yes                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2016-04-27
25    15886.0  109 04 0A 080.00          VACANT RES LAND            None 2014-05-13   255590.0  20140514-0041276           No                                  None                                    None      NaN                       None        NaN            NaN         NaN        NaN       NaN       NaN       NaN        2014-05-13
16     3299.0   052 01 0 296.00            SINGLE FAMILY            None 2013-05-31    79370.0  20130620-0063114           No                  KIRBY, WILLIAM E. JR           726  IDLEWILD DR, MADISON, TN     0.22  GENERAL SERVICES DISTRICT    16000.0        60800.0     76800.0     1957.0       2.0       1.0       0.0        2013-05-31
12    47293.0   043 04 0 014.00            SINGLE FAMILY            None 2016-04-29   190000.0  20160503-0043576           No      CRIPPS, WILLIE S. JR. & GINEA M.         112  HILLER DR, OLD HICKORY, TN     0.29  GENERAL SERVICES DISTRICT    17000.0       143700.0    173600.0     1956.0       4.0       2.0       1.0        2016-04-29
Tenemos (29, 20) filas y columnas

In [39]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT A.ParcelID, A.PropertyAddress, B.ParcelID, B.PropertyAddress,
                  ISNULL(A.PropertyAddress, B.PropertyAddress) AS New_Col
                    FROM NashvilleHousing AS A
                    JOIN NashvilleHousing AS B
                        ON A.ParcelID = B.ParcelID
                        AND A.UniqueID <> B.UniqueID
                    WHERE A.PropertyAddress IS NULL;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Nos permite ejecutar nuestra tabla "NashvilleHousing"
#! Hacemos un Join a la misma tabla en base a las columnas "ParcelID", "UniqueID".
#! Filtramos los valores nulos de la primera tabla "PropertyAddress".
#! El codigo nos dice que si la columna "PropertyAddress" de la tabla A, tiene valores vacios, esto deben llenarse con la columna "PropertyAddress" de la tabla B.

            ParcelID PropertyAddress          ParcelID                 PropertyAddress                         New_Col
24   092 13 0 322.00            None   092 13 0 322.00      237  37TH AVE N, NASHVILLE      237  37TH AVE N, NASHVILLE
18   044 05 0 135.00            None   044 05 0 135.00    202  KEETON AVE, OLD HICKORY    202  KEETON AVE, OLD HICKORY
19   052 01 0 296.00            None   052 01 0 296.00       726  IDLEWILD DR, MADISON       726  IDLEWILD DR, MADISON
11  034 07 0B 015.00            None  034 07 0B 015.00     2524  VAL MARIE DR, MADISON     2524  VAL MARIE DR, MADISON
33  113 14 0A 002.00            None  113 14 0A 002.00    7601  CHIPMUNK LN, NASHVILLE    7601  CHIPMUNK LN, NASHVILLE
15   043 04 0 014.00            None   043 04 0 014.00     112  HILLER DR, OLD HICKORY     112  HILLER DR, OLD HICKORY
7    034 03 0 059.00            None   034 03 0 059.00         2117  PAULA DR, MADISON         2117  PAULA DR, MADISON
25   092 13 0 339.00            None   092 13 0 339.00      311  35TH AVE N, NASHVILLE      311  35TH AVE N, NASHVILLE
3   026 06 0A 038.00            None  026 06 0A 038.00  109  CANTON CT, GOODLETTSVILLE  109  CANTON CT, GOODLETTSVILLE
27   093 08 0 054.00            None   093 08 0 054.00     700  GLENVIEW DR, NASHVILLE     700  GLENVIEW DR, NASHVILLE

In [40]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''UPDATE A
                            SET PropertyAddress = ISNULL(A.PropertyAddress, B.PropertyAddress)
                            FROM NashvilleHousing AS A
                            JOIN NashvilleHousing AS B
                                ON A.ParcelID = B.ParcelID
                                AND A.UniqueID <> B.UniqueID
                            WHERE A.PropertyAddress IS NULL;
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".

Actualización de tabla Exitosa

In [41]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT A.ParcelID, A.PropertyAddress, B.ParcelID, B.PropertyAddress,
                  ISNULL(A.PropertyAddress, B.PropertyAddress) AS New_Col
                    FROM NashvilleHousing AS A
                    JOIN NashvilleHousing AS B
                        ON A.ParcelID = B.ParcelID
                        AND A.UniqueID <> B.UniqueID
                    WHERE A.PropertyAddress IS NULL;''', conexion)

# Muestra el DataFrame
print(df)

#! Volvemos a ejecutar el codigo y al haber sido actualizado, no nos deberia aparecer valores vacios en la columna "PropertyAddress".

Empty DataFrame
Columns: [ParcelID, PropertyAddress, ParcelID, PropertyAddress, New_Col]
Index: []

In [20]:
'''
Breaking out Address into individual columns (Address, City, State)
'''

'\nBreaking out Address into individual columns (Address, City, State)\n'

In [21]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT 
                    SUBSTRING (PropertyAddress, 1, CHARINDEX (',', PropertyAddress) - 1) AS Address
                    , SUBSTRING (PropertyAddress, CHARINDEX (',', PropertyAddress) + 1, LEN ( PropertyAddress)) AS Address
                    FROM NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Nos permite separar los valores por el delimitador ",".
#! Generamos 2 columnas con los valores separados.

                    Address     Address
38842    1909 B  TRUETT AVE   NASHVILLE
17735    3303  LEONDALE TER   NASHVILLE
36860    1202 MCFERRIN  AVE   NASHVILLE
13099     4561  HAMILTON LN     ANTIOCH
21067    4060  FAIRMEADE DR   NASHVILLE
8787   630 HARPETH BEND  DR   NASHVILLE
20348         4021  MOSS RD     ANTIOCH
2678    561  SUMMIT OAKS CT   NASHVILLE
15373          0  CHERRY ST     MADISON
29221      1841  ANNALEE DR     ANTIOCH

In [22]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Alteración de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                        ALTER TABLE NashvilleHousing
                            ADD PropertySplitAddress nvarchar(255);
                    '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite alterar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:1
#! Alteramos la tabla original, creando una columna titutalada "PropertySplitAddress"

Alteración de tabla Exitosa

In [23]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                    UPDATE NashvilleHousing
                    SET PropertySplitAddress = SUBSTRING (PropertyAddress, 1, CHARINDEX (',', PropertyAddress) - 1)
                        ;
                        '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:2
#! Actualizamos los valores de la columna "PropertySplitAddress" con los datos que se encuentran antes de la coma ',', referente a la columna original "PropertyAddress"

Actualización de tabla Exitosa

In [24]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''ALTER TABLE NashvilleHousing
                        ADD PropertySplitCity nvarchar (255);
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite transformar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:3
#! Alteramos la tabla original, creando una columna titutalada "PropertySplitCity"

Actualización de tabla Exitosa

In [25]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
            UPDATE NashvilleHousing
                SET PropertySplitCity = SUBSTRING (PropertyAddress, CHARINDEX (',', PropertyAddress) + 1, LEN ( PropertyAddress))
        ;
                        '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:4
#! Actualizamos los valores de la columna "PropertySplitAddress" con los datos que se encuentran despues de la coma ',', referente a la columna original "PropertyAddress"

Actualización de tabla Exitosa

In [26]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT *
                  FROM NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Volvemos a ejecutar el codigo y al haber sido actualizado, nos deberia aparecer las 2 nuevas columnas creadas "PropertySplitAddress" "PropertySplitCity".

       UniqueID           ParcelID            LandUse                    PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                          OwnerName                       OwnerAddress  ...  LandValue BuildingValue  TotalValue  YearBuilt  Bedrooms  FullBath  HalfBath  SaleDateConverted    PropertySplitAddress PropertySplitCity
33374     4820.0   075 09 0 004.00      SINGLE FAMILY      302  BONNAHURST DR, HERMITAGE 2013-06-26   105000.0  20130628-0066645           No          JENKINS, WAYNE & ELISA J.  302  BONNAHURST DR, HERMITAGE, TN  ...    21000.0       85700.0    106700.0     1962.0       3.0       1.0       1.0         2013-06-26      302  BONNAHURST DR         HERMITAGE
37311    38768.0  082 09 0I 001.00  RESIDENTIAL CONDO          312  TAYLOR ST, NASHVILLE 2015-09-29   400000.0  20151006-0101619           No                               None                               None  ...        NaN           NaN         NaN        NaN       NaN       NaN       NaN         2015-09-29          312  TAYLOR ST         NASHVILLE
45591    49037.0  094 02 0B 008.00  RESIDENTIAL CONDO        1805 BSEVIER  ST, NASHVILLE 2016-05-23   379000.0  20160526-0053075           No                               None                               None  ...        NaN           NaN         NaN        NaN       NaN       NaN       NaN         2016-05-23        1805 BSEVIER  ST         NASHVILLE
8993      8782.0  143 03 0B 046.00  RESIDENTIAL CONDO  6931  HIGHLAND PARK DR, NASHVILLE 2013-10-18   145000.0  20131021-0109854           No                               None                               None  ...        NaN           NaN         NaN        NaN       NaN       NaN       NaN         2013-10-18  6931  HIGHLAND PARK DR         NASHVILLE
16399    38343.0   044 11 0 083.00      SINGLE FAMILY       402  HADLEY AVE, OLD HICKORY 2015-09-16   105000.0  20150929-0098695           No                 ROMERO, LILLIAN A.   402  HADLEY AVE, OLD HICKORY, TN  ...    17000.0       60300.0     77300.0     1931.0       3.0       1.0       0.0         2015-09-16         402  HADLEY AVE       OLD HICKORY
7726     36253.0  141 15 0D 131.00      SINGLE FAMILY    313  STONEHINDGE WAY, NASHVILLE 2015-08-14   345000.0  20150818-0083006           No                               None                               None  ...        NaN           NaN         NaN        NaN       NaN       NaN       NaN         2015-08-14    313  STONEHINDGE WAY         NASHVILLE
29170    30376.0  174 01 0B 016.00  RESIDENTIAL CONDO      2106  RIVENDELL TRCE, ANTIOCH 2015-05-11  1861976.0  20150512-0043294           No                               None                               None  ...        NaN           NaN         NaN        NaN       NaN       NaN       NaN         2015-05-11    2106  RIVENDELL TRCE           ANTIOCH
24675    27597.0   172 02 0 111.00      SINGLE FAMILY         6028  DEER TRCE, NASHVILLE 2015-03-23   379500.0  20150406-0029536           No  MCKNIGHT, QUINTON G. & NIKISHA T.     6028  DEER TRCE, NASHVILLE, TN  ...    67000.0      300400.0    367400.0     1994.0       3.0       2.0       1.0         2015-03-23         6028  DEER TRCE         NASHVILLE
35877     8818.0   081 10 0 177.00      SINGLE FAMILY        1728  25TH AVE N, NASHVILLE 2013-10-30    85500.0  20131031-0113261           No                HORTON, ZAINEB JEAN    1728  25TH AVE N, NASHVILLE, TN  ...    13000.0       50900.0     63900.0     1963.0       3.0       1.0       0.0         2013-10-30        1728  25TH AVE N         NASHVILLE
36657    53323.0   082 03 0 111.00      SINGLE FAMILY          1121 N 2ND  ST, NASHVILLE 2016-08-18   560000.0  20160819-0087092           No                    SIMMONS, PAMELA      1121  N 2ND ST, NASHVILLE, TN  ...    27000.0       37700.0     64700.0     1930.0       3.0       1.0       1.0         2016-08-18          1121 N 2ND  ST         NASHVILLE

[10 rows x 22 columns]

In [27]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT
                        PARSENAME(REPLACE(OwnerAddress, ',', '.'), 3) AS Dirección
                        , PARSENAME(REPLACE(OwnerAddress, ',', '.'), 2) AS Ciudad
                        , PARSENAME(REPLACE(OwnerAddress, ',', '.'), 1) AS Estado
                        , OwnerAddress
                        FROM NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Volvemos a ejecutar el codigo y al haber sido actualizado, nos deberia aparecer las 2 nuevas columnas creadas "PropertySplitAddress" "PropertySplitCity".

               Dirección      Ciudad Estado                      OwnerAddress
49933               None        None   None                              None
30667               None        None   None                              None
14379               None        None   None                              None
45590               None        None   None                              None
21992               None        None   None                              None
45324       1013  DEW ST   NASHVILLE     TN       1013  DEW ST, NASHVILLE, TN
46053  2617  LAKELAND DR   NASHVILLE     TN  2617  LAKELAND DR, NASHVILLE, TN
46372               None        None   None                              None
19697               None        None   None                              None
45023               None        None   None                              None

In [28]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Alteración de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                        ALTER TABLE NashvilleHousing
                            ADD OwnerSplitAddress nvarchar(255);
                    '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite alterar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:1
#! Alteramos la tabla original, creando una columna titutalada "OwnerSplitAddress"

Alteración de tabla Exitosa

In [29]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                    UPDATE NashvilleHousing
                    SET OwnerSplitAddress = PARSENAME(REPLACE(OwnerAddress, ',', '.'), 3)
                        ;
                        '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:2
#! Actualizamos los valores de la columna "OwnerSplitAddress" con los datos que se encuentran antes de la coma ',', referente a la columna original "OwnerSplitAddress"

Actualización de tabla Exitosa

In [30]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''ALTER TABLE NashvilleHousing
                        ADD OwnerSplitCity nvarchar (255);
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite transformar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:3
#! Alteramos la tabla original, creando una columna titutalada "OwnerSplitCity"

Actualización de tabla Exitosa

In [31]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
            UPDATE NashvilleHousing
                SET OwnerSplitCity = PARSENAME(REPLACE(OwnerAddress, ',', '.'), 2)
        ;
                        '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:4
#! Actualizamos los valores de la columna "OwnerSplitCity" con los datos que se encuentran despues de la coma ',', referente a la columna original "OwnerSplitCity"

Actualización de tabla Exitosa

In [32]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Alteración de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                        ALTER TABLE NashvilleHousing
                            ADD OwnerSplitState nvarchar(255);
                    '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite alterar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:5
#! Alteramos la tabla original, creando una columna titutalada "OwnerSplitState"

Alteración de tabla Exitosa

In [33]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                    UPDATE NashvilleHousing
                    SET OwnerSplitState = PARSENAME(REPLACE(OwnerAddress, ',', '.'), 1)
                        ;
                        '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:6
#! Actualizamos los valores de la columna "OwnerSplitState" con los datos que se encuentran antes de la coma ',', referente a la columna original "OwnerSplitState"

Actualización de tabla Exitosa

In [34]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT *
                  FROM NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Volvemos a ejecutar el codigo y al haber sido actualizado, nos deberia aparecer las 3 nuevas columnas creadas "OwnerSplitAddress" "OwnerSplitCity" "OwnerSplitState".

       UniqueID           ParcelID            LandUse                   PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                       OwnerName                         OwnerAddress  ...  YearBuilt Bedrooms  FullBath  HalfBath  SaleDateConverted   PropertySplitAddress  PropertySplitCity   OwnerSplitAddress  OwnerSplitCity OwnerSplitState
6066     44369.0  135 08 0A 629.00  RESIDENTIAL CONDO     629  LONGHUNTER CT, NASHVILLE 2016-02-26    94000.0  20160304-0021004           No                            None                                 None  ...        NaN      NaN       NaN       NaN         2016-02-26     629  LONGHUNTER CT          NASHVILLE                None            None            None
19686    34844.0  053 09 0A 009.00      ZERO LOT LINE         1424  E CEDAR LN, MADISON 2015-07-30    97000.0  20150805-0077788           No                            None                                 None  ...        NaN      NaN       NaN       NaN         2015-07-30       1424  E CEDAR LN            MADISON                None            None            None
35177    18944.0   081 08 0 228.00      SINGLE FAMILY        1819  6TH AVE N, NASHVILLE 2014-07-02   368000.0  20140703-0058884           No           WILLIAMS, MAKENZIE A.       1819  6TH AVE N, NASHVILLE, TN  ...     2007.0      3.0       2.0       1.0         2014-07-02        1819  6TH AVE N          NASHVILLE     1819  6TH AVE N       NASHVILLE              TN
16480    15759.0   044 14 0 038.00      SINGLE FAMILY   271  MARTINGALE DR, OLD HICKORY 2014-05-08   137000.0  20140523-0044573           No                 DYE, WILLIAM B.  271  MARTINGALE DR, OLD HICKORY, TN  ...     1947.0      2.0       2.0       1.0         2014-05-08     271  MARTINGALE DR        OLD HICKORY  271  MARTINGALE DR     OLD HICKORY              TN
7905     24883.0  142 04 0A 030.00  RESIDENTIAL CONDO  210  OLD HICKORY BLVD, NASHVILLE 2014-12-01    64000.0  20141202-0110421           No                            None                                 None  ...        NaN      NaN       NaN       NaN         2014-12-01  210  OLD HICKORY BLVD          NASHVILLE                None            None            None
31004    40808.0  072 14 0I 003.00  RESIDENTIAL CONDO      1302  CHESTER AVE, NASHVILLE 2015-11-20   290182.0  20151204-0122266           No                            None                                 None  ...        NaN      NaN       NaN       NaN         2015-11-20      1302  CHESTER AVE          NASHVILLE                None            None            None
39056     4727.0   083 08 0 199.00      SINGLE FAMILY      1031  MITCHELL RD, NASHVILLE 2013-06-27   299900.0  20130703-0068802           No  CARTER, BRETT R. & VIRGINIA W.     1031  MITCHELL RD, NASHVILLE, TN  ...     1960.0      3.0       2.0       1.0         2013-06-27      1031  MITCHELL RD          NASHVILLE   1031  MITCHELL RD       NASHVILLE              TN
27852    46258.0  173 09 0A 530.00      SINGLE FAMILY   9034  RIGDEN MILL DR, NASHVILLE 2016-04-22   199500.0  20160426-0040274           No                            None                                 None  ...        NaN      NaN       NaN       NaN         2016-04-22   9034  RIGDEN MILL DR          NASHVILLE                None            None            None
46033    49192.0   095 11 0 188.00             DUPLEX     2417 WOODBERRY  DR, NASHVILLE 2016-05-06   265000.0  20160510-0046571           No              BEAIRD, ELI & CORI    2417  WOODBERRY DR, NASHVILLE, TN  ...     1958.0      3.0       3.0       NaN         2016-05-06     2417 WOODBERRY  DR          NASHVILLE  2417  WOODBERRY DR       NASHVILLE              TN
54718    24726.0  116 12 0K 001.00  RESIDENTIAL CONDO       3900  WALLACE LN, NASHVILLE 2014-12-01   237500.0  20141203-0110858           No                            None                                 None  ...        NaN      NaN       NaN       NaN         2014-12-01       3900  WALLACE LN          NASHVILLE                None            None            None

[10 rows x 25 columns]

In [35]:
'''
Change Y and N to Yes and No in "Sold as Vacant" field
'''

'\nChange Y and N to Yes and No in "Sold as Vacant" field\n'

In [36]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT DISTINCT (SoldAsVacant), COUNT (SoldAsVacant) AS CountSoldAsVacant
                        FROM NashvilleHousing
                        GROUP BY SoldAsVacant
                        ORDER BY 2;''', conexion)

# Muestra el DataFrame
print(df)

#! Filtramos los valores unicos de la columna "SoldAsVacant".
#! Hacemos un coreo de los valores unicos de la columna "SoldAsVacant".
#! Agrupamos los valores por medio de la columna "SoldAsVacant".
#! Ordenamos los valores.

  SoldAsVacant  CountSoldAsVacant
0          Yes               4675
1           No              51802

In [37]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT SoldAsVacant
                  , CASE When SoldAsVacant = 'Y' THEN 'Yes'
                        WHEN SoldAsVacant = 'N' THEN 'No'
                        ELSE SoldAsVacant
                        END
                    FROM NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.sample(15))

#! Revisamos la columna con errores y generamos una nueva con los cambios, para ver si el codigo funciona.
#! Si este funciona, como es en nuestro caso, aplicamos lo indicado a la tabla original.

      SoldAsVacant
44390           No   No
44177           No   No
8873            No   No
36163           No   No
16865           No   No
36968           No   No
5847            No   No
40189           No   No
684             No   No
82              No   No
1217            No   No
15267           No   No
15777           No   No
49605           No   No
27615          Yes  Yes

In [38]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Actualización de tabla Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''
                    UPDATE NashvilleHousing
                        SET SoldAsVacant = CASE When SoldAsVacant = 'Y' THEN 'Yes'
                        WHEN SoldAsVacant = 'N' THEN 'No'
                        ELSE SoldAsVacant
                        END;
                        '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite actualizar nuestra tabla, en nuestro ejemplo es "NashvilleHousing".
#! Paso:1
#! Actualizamos los valores de la columna "SoldAsVacant", cambiamos los 'N' por 'No', asi como los 'Y' por 'Yes'.

Actualización de tabla Exitosa

In [39]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''SELECT DISTINCT (SoldAsVacant), COUNT (SoldAsVacant) AS CountSoldAsVacant
                        FROM NashvilleHousing
                        GROUP BY SoldAsVacant
                        ORDER BY 2;''', conexion)

# Muestra el DataFrame
print(df)

#! Cambiamos los valores de la tabla "SoldAsVacant".
#! Valor 'N' por 'No', valor 'Y' por 'Yes'.

  SoldAsVacant  CountSoldAsVacant
0          Yes               4675
1           No              51802

In [40]:
'''
Remove Duplicates
'''

'\nRemove Duplicates\n'

In [41]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''WITH RowNumCTE AS (
                        SELECT *,
                            ROW_NUMBER () OVER (
                            PARTITION BY ParcelID,
                                        PropertyAddress,
                                        SalePrice,
                                        SaleDate,
                                        LegalReference
                                        ORDER BY
                                            UniqueID
                                            ) row_num
                        FROM NashvilleHousing
                        )
                        SELECT *
                        FROM RowNumCTE
                        WHERE row_num > 1
                        ORDER BY PropertyAddress;''', conexion)

# Muestra el DataFrame
print(df.sample(10))

#! Nos muestra los valores mayores a 1, haciendo referencia a la columna "row_num".

     UniqueID           ParcelID            LandUse                    PropertyAddress   SaleDate  SalePrice    LegalReference SoldAsVacant                         OwnerName                       OwnerAddress  ...  Bedrooms FullBath  HalfBath  SaleDateConverted    PropertySplitAddress  PropertySplitCity     OwnerSplitAddress  OwnerSplitCity  OwnerSplitState row_num
0      27354.0   107 14 0 157.00      SINGLE FAMILY       1003  BRILEY PKWY, NASHVILLE 2015-02-12    80000.0  20150219-0014347           No                  GREEN, KASSANDRA   1003  BRILEY PKWY, NASHVILLE, TN  ...       2.0      2.0       0.0         2015-02-12       1003  BRILEY PKWY          NASHVILLE     1003  BRILEY PKWY       NASHVILLE               TN       2
1      27383.0   150 04 0 144.00      SINGLE FAMILY      1005  ESTURBRIDGE CT, ANTIOCH 2015-02-13   180000.0  20150213-0013547           No                       TINNEY, STU  1005  ESTURBRIDGE CT, ANTIOCH, TN  ...       4.0      3.0       0.0         2015-02-13    1005  ESTURBRIDGE CT            ANTIOCH  1005  ESTURBRIDGE CT         ANTIOCH               TN       2
2      27362.0   119 16 0 084.00             DUPLEX       1006  DRUMMOND DR, NASHVILLE 2015-02-17    80000.0  20150218-0014086           No                       POST, KEVIN   1006  DRUMMOND DR, NASHVILLE, TN  ...       4.0      3.0       0.0         2015-02-17       1006  DRUMMOND DR          NASHVILLE     1006  DRUMMOND DR       NASHVILLE               TN       2
3      27132.0   091 08 0 056.00      SINGLE FAMILY        1011  43RD AVE N, NASHVILLE 2015-02-23    69900.0  20150227-0017102           No              MENDING HEARTS, INC.    1011  43RD AVE N, NASHVILLE, TN  ...       3.0      2.0       0.0         2015-02-23        1011  43RD AVE N          NASHVILLE      1011  43RD AVE N       NASHVILLE               TN       2
4      27368.0  135 10 0E 020.00  RESIDENTIAL CONDO  1023  CAPITAL FUNDS CT, NASHVILLE 2015-02-06   118981.0  20150210-0012380           No                              None                               None  ...       NaN      NaN       NaN         2015-02-06  1023  CAPITAL FUNDS CT          NASHVILLE                  None            None             None       2
..         ...               ...                ...                                ...        ...        ...               ...          ...                               ...                                ...  ...       ...      ...       ...                ...                     ...                ...                   ...             ...              ...     ...
99     12702.0  175 06 0A 026.00      SINGLE FAMILY       904  BIRCHMILL PT S, ANTIOCH 2014-02-03   112000.0  20140205-0010116           No                              None                               None  ...       NaN      NaN       NaN         2014-02-03     904  BIRCHMILL PT S            ANTIOCH                  None            None             None       2
100    27135.0   091 10 0 379.00      SINGLE FAMILY          906  DELRAY DR, NASHVILLE 2015-02-13   120000.0  20150218-0014209           No  DIAZ, JONATHAN A. & ELIZABETH G.      906  DELRAY DR, NASHVILLE, TN  ...       2.0      1.0       0.0         2015-02-13          906  DELRAY DR          NASHVILLE        906  DELRAY DR       NASHVILLE               TN       2
101    27378.0  149 04 0A 010.00      SINGLE FAMILY        908  TOWNVIEW PL, NASHVILLE 2015-02-06   138900.0  20150210-0012194           No                              None                               None  ...       NaN      NaN       NaN         2015-02-06        908  TOWNVIEW PL          NASHVILLE                  None            None             None       2
102    12620.0  107 13 0A 026.00  RESIDENTIAL CONDO         926  COARSEY DR, NASHVILLE 2014-02-05    25000.0  20140207-0011111           No                              None                               None  ...       NaN      NaN       NaN         2014-02-05         926  COARSEY DR          NASHVILLE                  None            None             None       2
103    27361.0   119 16 0 080.00      SINGLE FAMILY        934  DRUMMOND DR, NASHVILLE 2015-02-13   139000.0  20150218-0013634           No                FORD, KELLY JOSEPH    934  DRUMMOND DR, NASHVILLE, TN  ...       2.0      1.0       0.0         2015-02-13        934  DRUMMOND DR          NASHVILLE      934  DRUMMOND DR       NASHVILLE               TN       2

[104 rows x 26 columns]

In [45]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Eliminación de duplicados, Exitoso")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''WITH RowNumCTE AS (
                        SELECT *,
                            ROW_NUMBER () OVER (
                            PARTITION BY ParcelID,
                                        PropertyAddress,
                                        SalePrice,
                                        SaleDate,
                                        LegalReference
                                        ORDER BY
                                            UniqueID
                                            ) row_num
                        FROM NashvilleHousing
                        )
                        DELETE
                        FROM RowNumCTE
                        WHERE row_num > 1;
'''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

# Nos permite eliminar los valores duplicados, en nuestro ejercicio son 104 filas

Eliminación de duplicados, Exitoso

In [60]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''Select*
                        From NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.shape)

#! Nos permite saber cuantas filas y columnas tenemos en nuestro data frame.

(56373, 25)

In [61]:
'''
Delete unused columns
'''

'\nDelete unused columns\n'

In [62]:
# Parámetros de conexión
server = 'DESKTOP-CK3D4E3\\SQLEXPRESS02'
database = 'PORTFOLIO_PROYECT'
#username = 'tu_usuario'
#password = 'tu_contraseña'

# Llevamos a cabo la conexión con el servidor

conexion = podbc.connect(driver= '{SQL server}', Database= '{PORTFOLIO_PROYECT}', host = server)

print("Eliminación de columnas Exitosa")

# Crear un cursor
cursor = conexion.cursor()

# Crear la tabla
create_table_query = '''ALTER TABLE NashvilleHousing
                            DROP COLUMN OwnerAddress, TaxDistrict,
                            PropertyAddress, SaleDate;
                            '''

# EmployeeID INT PRIMARY KEY, "Nos permite considerar la columna como la llave primaria"

cursor.execute(create_table_query)

# Nos aseguramos de cerrar la conexión

conexion.commit()
conexion.close()

#! Nos permite eliminar las columnas seleccionadas en nuestra consulta.

Actualización de tabla Exitosa

In [64]:
# Conecta a la base de datos
conexion = conexion_sql_server()

pd.set_option('display.expand_frame_repr', False) #! Muestra los resultados de manera horizontal.

# Realizamos la consulta y obtenemos los resultados en un DataFrame
df = select_to_df('''Select*
                        From NashvilleHousing;''', conexion)

# Muestra el DataFrame
print(df.shape)

#! Nos permite saber cuantas filas y columnas tenemos en nuestro data frame.

(56373, 21)